Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition Constructor (Identifier, Identifier)
 Creates a new input definition instance with one identifier.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Identifier viewId,
	Identifier ObjectId
)
Public Sub New (
	viewId As Identifier,
	ObjectId As Identifier
)
Parameters
viewId
Type: Tekla.Structures.Identifier
The identifier for the view object.
ObjectId
Type: Tekla.Structures.Identifier
The object identifier.
See Also
Reference
DrawingPluginBase.InputDefinition Class
DrawingPluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace